# ----------------------------
# CLIツール・開発基本ツール群
# ----------------------------

brew "git"                # Git（バージョン管理）
brew "gh"                 # GitHub CLI（PRやIssue操作が便利）
brew "node"               # Node.js（React / Next.js開発に必須）
brew "yarn"               # JavaScriptパッケージマネージャー（Next.js系プロジェクト向け）
brew "python@3.12"        # 最新のPython（バックエンドやツール作成用）
brew "jq"                 # JSON整形・抽出CLIツール（APIレスポンス処理などに便利）
brew "curl"               # HTTP通信コマンドラインツール（APIテストなど）
brew "ffmpeg"             # 動画・音声処理ツール（変換や切り出しなど）
brew "tree"               # ディレクトリ構造をツリー表示（軽量便利）
brew "zsh-completions"    # Zsh用の補完機能追加（CLI操作の補助）

# ----------------------------
# GUIアプリ
# ----------------------------

cask "google-chrome"
cask "visual-studio-code"
cask "docker"
cask "slack"
cask "notion"
cask "zoom"
cask "spotify"
cask "todoist"


